<script>
import Swiper from 'swiper';
import 'swiper/swiper-bundle.css';

export default {
  mounted() {
    this.$nextTick(() => {
      new Swiper('.slider', {
        loop: false,
        slidesPerView: 1,
        slidesPerGroup: 1,
        autoplay: {
          delay: 1000, // Изменил значение на 2000 (2 секунды)
        },
        navigation: {
          nextEl: '.swiper-button-next',
          prevEl: '.swiper-button-prev',
        },
      });
    });
  }
}
</script>


<template>
  <div class="container_2">
    <div class="block">
      <div class="text">
        <h2 class="title">Добро пожаловать в компанию «Тихоход»</h2>
        <h5 class="content">
            Мы - ведущая компания по круизным путешествиям и экспедиционным круизам по России.  С момента своего
          основания мы ставим своей миссией открывать удивительные места нашей прекрасной страны и предлагать
          незабываемые приключения на воде.<br />
            Наша команда состоит из опытных профессионалов, которые разделяют страсть к путешествиям и преданы своей
          работе. Мы постоянно стремимся превзойти ожидания наших гостей и создать атмосферу, где каждый момент на борту
          становится частью незабываемого опыта.<br />
            Наши круизы дарят возможность насладиться красотой российских рек и водных путей, позволяя
          путешественникам погрузиться в богатую историю, потрясающую культуру и запоминающиеся пейзажи нашей родины. Мы
          предлагаем экспедиции в самые удивительные уголки России, от морских побережий до глубин Сибири, от Черного
          моря до Белого моря.
        </h5>
      </div>

      <div class="slider-container">
        <div class="slider">

          <div class="navigation">
            <div class="button-prev">
              <svg class="button-svg" xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="-2 -2 36 36">
              <rect xmlns="http://www.w3.org/2000/svg" x="1" y="1" width="32" height="32" rx="16" />
                <path d="M12.9979 17.9976L19.0046 24.0043C19.1363 24.1371 19.293 24.2425 19.4656 24.3144C19.6383 24.3863 19.8234 24.4233 20.0104 24.4233C20.1975 24.4233 20.3826 24.3863 20.5553 24.3144C20.7279 24.2425 20.8846 24.1371 21.0163 24.0043C21.2801 23.7389 21.4282 23.3798 21.4282 23.0055C21.4282 22.6313 21.2801 22.2722 21.0163 22.0068L16.0013 16.9918L21.0163 11.9768C21.2801 11.7114 21.4282 11.3523 21.4282 10.978C21.4282 10.6038 21.2801 10.2447 21.0163 9.97929C20.8839 9.84799 20.7269 9.74412 20.5543 9.67362C20.3817 9.60312 20.1969 9.56738 20.0104 9.56846C19.824 9.56738 19.6392 9.60312 19.4666 9.67362C19.294 9.74412 19.137 9.84799 19.0046 9.97929L12.9979 15.986C12.8652 16.1177 12.7598 16.2743 12.6878 16.447C12.6159 16.6196 12.5789 16.8048 12.5789 16.9918C12.5789 17.1788 12.6159 17.364 12.6878 17.5366C12.7598 17.7092 12.8652 17.8659 12.9979 17.9976Z"></path>
              </svg>
            </div>


            <div class="button-next">
              <svg class="button-svg" xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="-2 -2 36 36">
              <rect xmlns="http://www.w3.org/2000/svg" x="1" y="1" width="32" height="32" rx="16"/>
                <path d="M21.0091 15.9941L15.0025 9.98741C14.8708 9.85463 14.7141 9.74923 14.5415 9.67731C14.3688 9.60539 14.1837 9.56836 13.9966 9.56836C13.8096 9.56836 13.6245 9.60539 13.4518 9.67731C13.2792 9.74923 13.1225 9.85463 12.9908 9.98741C12.727 10.2528 12.5789 10.6119 12.5789 10.9862C12.5789 11.3604 12.727 11.7195 12.9908 11.9849L18.0058 16.9999L12.9908 22.0149C12.727 22.2803 12.5789 22.6394 12.5789 23.0137C12.5789 23.3879 12.727 23.747 12.9908 24.0124C13.1232 24.1437 13.2802 24.2476 13.4528 24.3181C13.6254 24.3886 13.8102 24.4243 13.9966 24.4232C14.1831 24.4243 14.3679 24.3886 14.5405 24.3181C14.7131 24.2476 14.8701 24.1437 15.0025 24.0124L21.0091 18.0057C21.1419 17.874 21.2473 17.7174 21.3192 17.5447C21.3912 17.3721 21.4282 17.1869 21.4282 16.9999C21.4282 16.8129 21.3912 16.6277 21.3192 16.4551C21.2473 16.2825 21.1419 16.1258 21.0091 15.9941Z"></path>
              </svg>
            </div>
          </div>

        </div>
      </div>


    </div>
  </div>
</template>



<style>
.slider-container{
  width: 700px;
  padding: 32px 48px 32px 16px;
}
.slider{
  background-color: #e0e0e0;
  border-radius: 8px;
  width: 100%;
  height: 100%;
  display: flex;
  justify-content: center; /* Выравнивание по центру по горизонтали */
  align-items: center;
}
.navigation{
  display: flex;
  justify-content: space-between; /* Равномерно распределить элементы по горизонтале */
  align-items: center; /* Выровнять элементы по вертикали */
  width: 100%;
  padding: 8px;
}


.button-prev rect,
.button-next rect{
  fill-opacity: 0.3;
  stroke: #fff;
  stroke-width: 2;
}

.button-next,
.button-prev{
  fill: white;
  cursor: pointer;
}
.button-svg:hover rect,
.button-svg:hover path {
  fill: #274da7;
  stroke: #274da7;
}

</style>

<!--
<div class="slider-container">
<div class="slider">
  <div class="swiper-wrapper">
    <div class="slide_crop">
      <div class="img_slider"><img src="/src/assets/2.png" alt="1"></div>
      <div class="img_slider"><img src="/src/assets/2.png" alt="3"></div>
      <div class="img_slider"><img src="/src/assets/2.png" alt="4"></div>
      <div class="img_slider"><img src="/src/assets/2.png" alt="5"></div>
    </div>
  </div>
</div>
<div class="navigation">
  <div class="button-prev">
    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20">
      <path d="M17 10.9999H9.41002L12.71 7.70994C12.8983 7.52164 13.0041 7.26624 13.0041 6.99994C13.0041 6.73364 12.8983 6.47825 12.71 6.28994C12.5217 6.10164 12.2663 5.99585 12 5.99585C11.7337 5.99585 11.4783 6.10164 11.29 6.28994L6.29002 11.2899C6.19898 11.385 6.12761 11.4972 6.08002 11.6199C5.98 11.8634 5.98 12.1365 6.08002 12.3799C6.12761 12.5027 6.19898 12.6148 6.29002 12.7099L11.29 17.7099C11.383 17.8037 11.4936 17.8781 11.6154 17.9288C11.7373 17.9796 11.868 18.0057 12 18.0057C12.132 18.0057 12.2627 17.9796 12.3846 17.9288C12.5065 17.8781 12.6171 17.8037 12.71 17.7099C12.8037 17.617 12.8781 17.5064 12.9289 17.3845C12.9797 17.2627 13.0058 17.132 13.0058 16.9999C13.0058 16.8679 12.9797 16.7372 12.9289 16.6154C12.8781 16.4935 12.8037 16.3829 12.71 16.2899L9.41002 12.9999H17C17.2652 12.9999 17.5196 12.8946 17.7071 12.707C17.8947 12.5195 18 12.2652 18 11.9999C18 11.7347 17.8947 11.4804 17.7071 11.2928C17.5196 11.1053 17.2652 10.9999 17 10.9999Z"></path>
    </svg>
  </div>
  <div class="button-next">
    <svg xmlns="http://www.w3.org/2000/svg"  width="20" height="20" viewBox="0 0 20 20">
      <path d="M17.92 11.6199C17.8724 11.4972 17.801 11.385 17.71 11.2899L12.71 6.28994C12.6168 6.1967 12.5061 6.12274 12.3842 6.07228C12.2624 6.02182 12.1319 5.99585 12 5.99585C11.7337 5.99585 11.4783 6.10164 11.29 6.28994C11.1968 6.38318 11.1228 6.49387 11.0723 6.61569C11.0219 6.73751 10.9959 6.86808 10.9959 6.99994C10.9959 7.26624 11.1017 7.52164 11.29 7.70994L14.59 10.9999H7C6.73478 10.9999 6.48043 11.1053 6.29289 11.2928C6.10536 11.4804 6 11.7347 6 11.9999C6 12.2652 6.10536 12.5195 6.29289 12.707C6.48043 12.8946 6.73478 12.9999 7 12.9999H14.59L11.29 16.2899C11.1963 16.3829 11.1219 16.4935 11.0711 16.6154C11.0203 16.7372 10.9942 16.8679 10.9942 16.9999C10.9942 17.132 11.0203 17.2627 11.0711 17.3845C11.1219 17.5064 11.1963 17.617 11.29 17.7099C11.383 17.8037 11.4936 17.8781 11.6154 17.9288C11.7373 17.9796 11.868 18.0057 12 18.0057C12.132 18.0057 12.2627 17.9796 12.3846 17.9288C12.5064 17.8781 12.617 17.8037 12.71 17.7099L17.71 12.7099C17.801 12.6148 17.8724 12.5027 17.92 12.3799C18.02 12.1365 18.02 11.8634 17.92 11.6199Z"></path>
    </svg>
  </div>
</div>
</div>-->
